import { createSlice } from "@reduxjs/toolkit";

export const factsSlice = createSlice({
  name: "starWars",
  initialState: {
    facts: [
      {
        number: 1,
        fact: "Прообразом Чубакки стал пес режиссера",
      },
      {
        number: 2,
        fact: "Актерам разрешили подобрать любимый цвет для своих световых мечей",
      },
      {
        number: 3,
        fact: "В фильме «Звездные войны-V: Империя наносит ответный удар» среди космических объектов можно заметить парящий ботинок и картофелину",
      },
      {
        number: 4,
        fact: "Дыхание Дарта Вейдера — это звуки дыхательной маски, подключенной к аквалангу",
      },
      {
        number: 5,
        fact: "Планета Татуин названа в честь реального города в Тунисе – стране, где происходила часть съемок",
      },
    ],
  },
  reducer: {},
});

export default factsSlice.reducer;
